self_bench/redis-benchmark_prod_nk.log
====== PING_INLINE ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
124843.95 requests per second

====== PING_BULK ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
124843.95 requests per second

====== SET ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125000.00 requests per second

====== GET ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125313.29 requests per second

====== INCR ======
  100000 requests completed in 0.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125944.58 requests per second

====== LPUSH ======
  100000 requests completed in 0.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
126903.55 requests per second

====== LPOP ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125628.14 requests per second

====== SADD ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125786.16 requests per second

====== SPOP ======
  100000 requests completed in 0.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
125313.29 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 0.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
127226.46 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.60 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
62539.09 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

79.98% <= 1 milliseconds
99.75% <= 2 milliseconds
99.87% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
25813.11 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
99.62% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 3 milliseconds
18621.97 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
99.91% <= 2 milliseconds
99.98% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
14450.87 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.05 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 1 milliseconds
95147.48 requests per second